#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "bceid_user_guid"
      + realm_id             = "moh_citizen"
      + user_attribute       = "bceid_user_guid"
    }

  # module.KEYCLOAK_PROD.module.moh_citizen.module.EMACCS.keycloak_openid_user_attribute_protocol_mapper.idir_user_guid will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "idir_user_guid" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = true
      + aggregate_attributes = false
      + claim_name           = "siteminder_user_guid"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "idir_user_guid"
      + realm_id             = "moh_citizen"
      + user_attribute       = "idir_user_guid"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EMACCS-UMS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-clients"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "25b73a09-5c9f-40a7-914e-c1108c61cc2e"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EMACCS-UMS.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EMACCS-UMS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "bd2e86ec-254f-4ddf-82f3-6e31e70b5bd8"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-clients"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_citizen.module.EMACCS.module.client-roles.keycloak_role.ROLES["CA"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id   = (known after apply)
      + description = "Clinical Advisor"
      + id          = (known after apply)
      + name        = "CA"
      + realm_id    = "moh_citizen"
    }

  # module.KEYCLOAK_PROD.module.moh_citizen.module.EMACCS.module.client-roles.keycloak_role.ROLES["CCA"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id   = (known after apply)
      + description = "Continuing Competence Analyst"
      + id          = (known after apply)
      + name        = "CCA"
      + realm_id    = "moh_citizen"
    }

  # module.KEYCLOAK_PROD.module.moh_citizen.module.EMACCS.module.client-roles.keycloak_role.ROLES["DIRECTOR"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id   = (known after apply)
      + description = "Director"
      + id          = (known after apply)
      + name        = "DIRECTOR"
      + realm_id    = "moh_citizen"
    }

  # module.KEYCLOAK_PROD.module.moh_citizen.module.EMACCS.module.client-roles.keycloak_role.ROLES["READONLY"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id   = (known after apply)
      + description = "Read Only"
      + id          = (known after apply)
      + name        = "READONLY"
      + realm_id    = "moh_citizen"
    }

  # module.KEYCLOAK_PROD.module.moh_citizen.module.EMACCS.module.client-roles.keycloak_role.ROLES["SYSADMIN"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id   = (known after apply)
      + description = "System Administrator"
      + id          = (known after apply)
      + name        = "SYSADMIN"
      + realm_id    = "moh_citizen"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*